nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxe31b/demo_apps/mc_pmsm/pmsm_enc/pin_mux.c
}

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDEBUG_UARTPins_deinit
 * Description   : This is a de-initialization function for 'BOARD_InitDEBUG_UARTPins' function.
 * It sets all pins features (routing, direction and electrical) to their after-reset state.
 * It also tries to route the previous peripheral signals to their default pins.
 *
 * END ****************************************************************************************************************/
void BOARD_InitDEBUG_UARTPins_deinit(void)
{
    
    /* PTE3 (pin 27) is disabled */
    const siul2_pin_settings_t BOARD_INITDEBUG_UARTPINS_DEINIT_pin_pte3_config =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 131u,
        .mux                         = kPORT_MUX_AS_GPIO,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .driveStrength               = kPORT_DRIVE_STRENTGTH_DISABLED,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .slewRateCtrlSel             = kPORT_SLEW_RATE_NOT_AVAILABLE,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_DISABLED,
        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
        .inputMuxReg                 = {
                                         144u,
                                         158u,
                                         19u,
                                         192u,
                                         350u,
                                         67u
                                       },
        .inputMux                    = { 
                                         kPORT_INPUT_MUX_ALT0,
                                         kPORT_INPUT_MUX_ALT0,
                                         kPORT_INPUT_MUX_ALT0,
                                         kPORT_INPUT_MUX_ALT0,
                                         kPORT_INPUT_MUX_ALT0,
                                         kPORT_INPUT_MUX_ALT0,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT
                                       },
        .initValue                   = 2u
    };
    SIUL2_PinInit(&BOARD_INITDEBUG_UARTPINS_DEINIT_pin_pte3_config);
    
    /* PTE14 (pin 26) is disabled */
    const siul2_pin_settings_t BOARD_INITDEBUG_UARTPINS_DEINIT_dsa =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 142u,
        .mux                         = kPORT_MUX_AS_GPIO,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .driveStrength               = kPORT_DRIVE_STRENTGTH_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .slewRateCtrlSel             = kPORT_SLEW_RATE_NOT_AVAILABLE,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_DISABLED,
        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
        .inputMuxReg                 = {
                                         145u,
                                         159u,
                                         29u,
                                         368u,
                                         4u,
                                         67u
                                       },
        .inputMux                    = { 
                                         kPORT_INPUT_MUX_ALT0,
                                         kPORT_INPUT_MUX_ALT0,
                                         kPORT_INPUT_MUX_ALT0,
                                         kPORT_INPUT_MUX_ALT0,
                                         kPORT_INPUT_MUX_ALT0,
                                         kPORT_INPUT_MUX_ALT0,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT
                                       },
        .initValue                   = 2u
    };
    SIUL2_PinInit(&BOARD_INITDEBUG_UARTPINS_DEINIT_dsa);
    
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLEDsPins:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'false'}
- pin_list:
  - {pin_num: '66', peripheral: SIUL2, signal: 'GPIO, 80', pin_signal: PTC16, direction: OUTPUT, initValue: state_1}
  - {pin_num: '71', peripheral: SIUL2, signal: 'GPIO, 78', pin_signal: PTC14, direction: OUTPUT, initValue: state_1}
  - {pin_num: '67', peripheral: SIUL2, signal: 'GPIO, 54', pin_signal: PTB22, direction: OUTPUT, initValue: state_1}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

